SELECT dbo.книги.название, dbo.авторы.им€ + ' ' + dbo.авторы.фамили€ AS "»м€ автора", YEAR(dbo.книги.[дата издани€]) AS "√од издани€" --книги ру задание 3--
	FROM dbo.авторы, dbo.книги, dbo.[книги-авторы]
	WHERE dbo.[книги-авторы].ид_авт = dbo.авторы.ид_авт AND dbo.[книги-авторы].ид_кни = dbo.книги.ид_кни AND dbo.книги.жанр <> 'классика' AND dbo.книги.жанр <> 'поэзи€' AND (YEAR(dbo.книги.[дата издани€]) = 2000 OR YEAR(dbo.книги.[дата издани€]) = 1998)
	ORDER BY dbo.авторы.фамили€ ASC, YEAR(dbo.книги.[дата издани€]) ASC